<script setup>
import { onMounted, reactive, ref } from 'vue'
const cultureData = [
    {
        id: 1,
        title: "潮剧",
        oneUrl: new URL("@/assets/cj1.jpg", import.meta.url).href,
        twoUrl: new URL("@/assets/cj2.jpg", import.meta.url).href,
        cons: "潮剧，又称潮音、潮调、白字戏，或潮州戏、潮音戏、泉潮雅调，是闽南语系剧种之一，国家级非物质文化遗产。它是以潮州方言（漳州南部用闽南方言）演唱的一个古老的地方戏曲剧种，源于宋元南戏，并吸收了弋阳、昆曲、皮黄、梆子戏的特长，结合本地民间艺术如潮州音乐等，形成了独特的艺术形式和风格。\n潮剧传统剧目分宋元南戏和明清传奇、文明戏和新编历史剧两大类，有剧目两千多个。潮剧的表演形式以歌舞、口技和赋诗为主，歌唱和表演动作要求慢而优美，具有较强的音乐性和。节奏感潮剧的角色行当齐全，包括生、旦、净、丑等，每种行当还有不同的类型，表演细腻生动，身段做工既有严谨的程序规范，又富于写意性。其中，生旦戏《扫窗会》被誉为我国戏曲以歌舞演故事的典型代表。\n总之，潮剧作为中华民族优秀文化表现形式的代表之一，具有深刻的历史意义和较高的审美价值，是中国古老戏曲存活于舞台的生动例证。"
    },
    {
        id: 2,
        title: "潮绣",
        oneUrl: new URL("@/assets/cx1.jpg", import.meta.url).href,
        twoUrl: new URL("@/assets/cx2.jpg", import.meta.url).href,
        cons: "潮绣，也称潮州刺绣，是中国四大名绣之一粤绣的重要流派，与广州刺绣（广绣）合称粤绣，发源于今潮汕地区，有着悠久的历史和深厚的文化底蕴。\n潮绣始于唐代，形成风格于明、清，流传于国内及东南亚一带。其绣艺精美细致，色彩富丽堂皇，具有强烈的地方色彩和独特的艺术风格。潮绣以垫高绣为主要特色，即在施绣之前先用纸丁、棉絮垫定图案造型，然后在上面用金银丝绒线施绣，使作品产生类似浮雕的艺术效果，看起来更加生动逼真。\n潮绣的构图饱满匀称，作品金碧辉煌，既有单一视点的构图，也有多视点的构图。在同一题材上表现手法多变，注重均衡对称，人物多做侧面观，花多做正面观，避免将立体重叠安置，但都重视纹地相衬，主次分明。潮绣的制作技艺繁复多变，使用的辅助材料比其它任何一种绣种都多，包括丝、绸、缎及近代尼龙、人造丝、涤纶、丝绒线、金银线、垫绒线以及棉絮、纸丁等原料。\n潮绣的针法变化多样，有平绣、过桥、踏针、捞花瓣、垫地、凹针、累钩绣等200余种，其中“垫、浮、勾、勒、通”的刺绣工艺至今仍为机器所无法取代。潮绣的品种大致可分为日用品、欣赏品和剧服三种，形式有绒绣、纱绣、金银线绣、珠绣四大类。潮绣的代表作品包括“九龙屏”、“吹箫引凤”等，多次荣获国内外大奖。\n潮绣不仅是潮汕地区的一种传统手工艺品，更是中华民族优秀文化的重要组成部分。它以其独特的艺术魅力和精湛的制作技艺，赢得了国内外人们的广泛赞誉和喜爱。同时，潮绣也是潮州文化的重要载体之一，对于传承和弘扬潮州文化、推动地方经济发展具有重要意义。\n潮剧传统剧目分宋元南戏和明清传奇、文明戏和新编历史剧两大类，有剧目两千多个。潮剧的表演形式以歌舞、口技和赋诗为主，歌唱和表演动作要求慢而优美，具有较强的音乐性和。节奏感潮剧的角色行当齐全，包括生、旦、净、丑等，每种行当还有不同的类型，表演细腻生动，身段做工既有严谨的程序规范，又富于写意性。其中，生旦戏《扫窗会》被誉为我国戏曲以歌舞演故事的典型代表。\n总之，潮剧作为中华民族优秀文化表现形式的代表之一，具有深刻的历史意义和较高的审美价值，是中国古老戏曲存活于舞台的生动例证。"
    },
    {
        id: 3,
        title: "潮州大锣鼓",
        oneUrl: new URL("@/assets/dlg1.jpg", import.meta.url).href,
        twoUrl: new URL("@/assets/dlg2.jpg", import.meta.url).href,
        cons: "潮州大锣鼓是潮汕地区一种极具特色的传统民俗文化活动，它以大鼓为中心，结合多种打击乐和管弦乐，形成了一种独特的演奏形式。这种艺术形式源远流长，最早可以追溯到唐宋年间，是潮汕地区最具代表性的民间音乐之一。\n潮州大锣鼓的演奏特点在于其气势磅礴、节奏明快、音色丰富。在演奏时，大鼓作为中心乐器，指挥着整个乐队的节奏和力度。同时，配以多种打击乐器，如锣、钹、鼓等，以及管弦乐器，如唢呐、二胡、琵琶等，共同营造出一种热烈、欢快、激昂的氛围。\n潮州大锣鼓的表演形式也十分独特。在游行表演中，队伍前面通常会有一根青竹挂着红幡，上面书写着“国泰民安”等吉祥语。接着是大旗队，肩扛大旗，一队数十人，甚至上百人，徐徐前进。随后是乐队，队员们身穿统一颜色的服装，头扎英雄巾，手持乐器，随着大鼓的节奏演奏出激昂的乐曲。在队伍中，还会有担炮囊与挑花篮的男女儿童，身着古装，化着花旦妆，增添了几分活泼和喜庆。\n潮州大锣鼓不仅具有深厚的艺术价值，还是潮汕地区民俗文化的重要组成部分。在节日庆典、庙会活动等场合，潮州大锣鼓都是必不可少的表演节目。它以其独特的魅力，吸引了众多观众的目光，成为展示潮汕地区文化魅力的重要窗口。同时，潮州大锣鼓也被列入国家级非物质文化遗产名录，得到了更好的保护和传承。\n潮剧传统剧目分宋元南戏和明清传奇、文明戏和新编历史剧两大类，有剧目两千多个。潮剧的表演形式以歌舞、口技和赋诗为主，歌唱和表演动作要求慢而优美，具有较强的音乐性和。节奏感潮剧的角色行当齐全，包括生、旦、净、丑等，每种行当还有不同的类型，表演细腻生动，身段做工既有严谨的程序规范，又富于写意性。其中，生旦戏《扫窗会》被誉为我国戏曲以歌舞演故事的典型代表。\n总之，潮剧作为中华民族优秀文化表现形式的代表之一，具有深刻的历史意义和较高的审美价值，是中国古老戏曲存活于舞台的生动例证。"
    },
    {
        id: 4,
        title: "潮州木雕",
        oneUrl: new URL("@/assets/md1.jpg", import.meta.url).href,
        twoUrl: new URL("@/assets/md2.jpg", import.meta.url).href,
        cons: "潮州木雕，又称潮州金漆木雕，是广东省的一种传统美术，也是国家级非物质文化遗产之一。这种艺术形式始于唐代，盛于明清，历史悠久，技艺精湛。\n潮州木雕具有鲜明的地方特色和艺术风格。它既有广府文化的渊源，又受到江浙一带如东阳木雕等流派的影响。在题材上，潮州木雕非常广泛，包括民间传说、古今人物、花鸟虫鱼、飞禽走兽、江海水族、戏剧故事等，几乎涵盖了生活的方方面面。\n在技艺上，潮州木雕以樟木为主要材料，采用深浅浮雕、圆雕、通雕等多种雕刻手法，精细入微，层次分明。特别是其多层次镂通和采用虚拟空间的表现手法，能将不同时空、不同距离、不同物像通过径路关系，将故事内容统一在同一画面上，被誉为“木上舞台”和“集大成”的美誉。\n此外，潮州木雕还有一个显著的特点就是金漆装饰。在雕刻完成后，艺人会在木雕上涂上金漆，使作品更加金碧辉煌，富丽堂皇。这种装饰手法不仅增强了木雕的观赏价值，也体现了潮州人民对美好生活的追求和向往。\n潮州木雕广泛应用于建筑、家居、神器装饰和公共场所陈设等领域。无论是寺庙、祠堂、豪宅还是普通民居，都可以看到潮州木雕的身影。其独特的艺术魅力和文化价值，使得潮州木雕成为中华民族优秀传统文化的瑰宝之一。\n潮剧传统剧目分宋元南戏和明清传奇、文明戏和新编历史剧两大类，有剧目两千多个。潮剧的表演形式以歌舞、口技和赋诗为主，歌唱和表演动作要求慢而优美，具有较强的音乐性和。节奏感潮剧的角色行当齐全，包括生、旦、净、丑等，每种行当还有不同的类型，表演细腻生动，身段做工既有严谨的程序规范，又富于写意性。其中，生旦戏《扫窗会》被誉为我国戏曲以歌舞演故事的典型代表。\n总之，潮剧作为中华民族优秀文化表现形式的代表之一，具有深刻的历史意义和较高的审美价值，是中国古老戏曲存活于舞台的生动例证。"
    },
    {
        id: 5,
        title: "潮州铁枝木偶戏",
        oneUrl: new URL("@/assets/mo1.jpg", import.meta.url).href,
        twoUrl: new URL("@/assets/mo2.jpg", import.meta.url).href,
        cons: "潮州铁枝木偶戏，又称潮州纸影戏，是广东省潮州市的传统戏剧形式，也是国家级非物质文化遗产之一。它起源于南宋时期，由中原移民传入的皮影戏演变而来，至今已有深厚的历史底蕴。\n潮州铁枝木偶戏的木偶制作精细，采用稻草为身，泥塑偶头，纸手、木足，并穿上戏装。木偶背后和双手都安有硬铁线，用于操纵表演。其操纵特点在于通过三根铁枝（中箸、左箸和右箸）来控制木偶的动作，中箸控制平衡，左、右箸则分别系于木偶的左、右手，以实现各种复杂的表演动作。\n在表演上，潮州铁枝木偶戏与潮剧相似，剧目、表演动作、音乐唱腔都与之相同。表演时，后台由三至四人操纵木偶，盘腿而坐，每人操纵一至二尊木偶。同时，后面还有伴唱和伴乐者，共同营造出一种独特的艺术氛围。\n潮州铁枝木偶戏的表演技艺精湛，能呈现飞天、入地、点火、射箭、骑马、张扇、划船、武打等高难度的动作，充分展现了艺人的高超技艺和木偶戏的独特魅力。此外，其乡土气息浓郁，唱腔音乐优美，深受人民群众的喜爱。\n潮州铁枝木偶戏不仅是潮州地区的传统艺术形式，也是中华民族优秀传统文化的瑰宝之一。它以其独特的艺术魅力和文化价值，在国内外享有盛誉。近年来，随着国家对非物质文化遗产保护的重视和扶持力度的加大，潮州铁枝木偶戏得到了更好的传承和发展。\n潮剧传统剧目分宋元南戏和明清传奇、文明戏和新编历史剧两大类，有剧目两千多个。潮剧的表演形式以歌舞、口技和赋诗为主，歌唱和表演动作要求慢而优美，具有较强的音乐性和。节奏感潮剧的角色行当齐全，包括生、旦、净、丑等，每种行当还有不同的类型，表演细腻生动，身段做工既有严谨的程序规范，又富于写意性。其中，生旦戏《扫窗会》被誉为我国戏曲以歌舞演故事的典型代表。\n总之，潮剧作为中华民族优秀文化表现形式的代表之一，具有深刻的历史意义和较高的审美价值，是中国古老戏曲存活于舞台的生动例证。"
    },
    {
        id: 6,
        title: "潮州泥塑",
        oneUrl: new URL("@/assets/ns1.jpg", import.meta.url).href,
        twoUrl: new URL("@/assets/ns2.jpg", import.meta.url).href,
        cons: "潮州泥塑，特别是大吴泥塑，是广东省潮州市潮安县浮洋镇大吴村的传统美术，被誉为国家级非物质文化遗产之一。这种艺术形式的历史可追溯到南宋理宗嘉熙元年（1237年），并在清代中叶至民国期间达到鼎盛。\n大吴泥塑的制作过程十分精细，包括挖泥、炼泥、捏塑、烧坯、彩绘五个主要环节。在制作过程中，艺人们采用雕、塑、捏、贴、刻、印、彩等多种技术手段，形成了独特的地方艺术特色。特别是在贴塑方面，大吴泥塑的技术独树一帜，作品栩栩如生，色彩鲜艳自然、清新典雅。\n大吴泥塑的作品以戏剧故事人物组合、人物头像为主，同时也包括佛像和反映现实生活的作品。这些作品不仅具有极高的艺术价值，而且富含深厚的文化内涵，寄寓了民众祈望吉祥和扬善惩恶的思想感情。此外，大吴泥塑的用途广泛，既可以作为儿童的玩偶，也可以作为家中的陈设品，甚至成为艺术家的案头摆设和收藏的艺术品。\n在大吴泥塑的传承过程中，吴潘强等艺人发挥了重要作用。他们不仅技艺精湛，而且勇于创新，为大吴泥塑的发展做出了巨大贡献。如今，大吴泥塑已经流传了20几代，成为研究潮州民俗文化的“活化石”。\n总之，潮州泥塑特别是大吴泥塑以其独特的艺术魅力和深厚的文化内涵，成为中华民族优秀传统文化的瑰宝之一。\n潮剧传统剧目分宋元南戏和明清传奇、文明戏和新编历史剧两大类，有剧目两千多个。潮剧的表演形式以歌舞、口技和赋诗为主，歌唱和表演动作要求慢而优美，具有较强的音乐性和。节奏感潮剧的角色行当齐全，包括生、旦、净、丑等，每种行当还有不同的类型，表演细腻生动，身段做工既有严谨的程序规范，又富于写意性。其中，生旦戏《扫窗会》被誉为我国戏曲以歌舞演故事的典型代表。\n总之，潮剧作为中华民族优秀文化表现形式的代表之一，具有深刻的历史意义和较高的审美价值，是中国古老戏曲存活于舞台的生动例证。"
    },
    {
        id: 7,
        title: "潮州嵌瓷",
        oneUrl: new URL("@/assets/cj1.jpg", import.meta.url).href,
        twoUrl: new URL("@/assets/cj2.jpg", import.meta.url).href,
        cons: "潮州嵌瓷，作为广东省潮州市的传统美术，也是国家级非物质文化遗产之一，具有悠久的历史和独特的艺术魅力。\n潮州嵌瓷始于明末清初，当时潮州陶瓷生产发达，民间艺人开始利用碎瓷片剪裁成简单的花卉、龙凤等图案，镶嵌在建筑物上作为装饰，变废为宝。到了清代，随着潮汕地区盖祠堂和建豪宅民居之风的盛行，嵌瓷工艺得到了进一步的发展。清末时期，瓷器生产作坊与嵌瓷艺人紧密合作，专门烧制各种低温彩色瓷碗，经过剪取，镶嵌成平面、浮雕或立体的图案纹样，装饰于建筑物的屋面、屋角、屋檐、门壁、墙壁上，甚至被用作庭园的室内装饰。\n潮州嵌瓷的艺术特色在于其色彩鲜艳、造型生动、立体感强，且久不褪色。它以绘画、雕塑为基础，用专门烧制的彩釉瓷片粘嵌出人物、花卉和飞禽走兽等艺术造型。嵌瓷作品题材丰富，包括花卉植物、飞禽走兽、历史人物、戏曲故事等，反映了当地民众颂扬正气、趋利避害、祈求福祉的美好愿望。\n潮州嵌瓷的制作工艺十分精细，包括剪裁和镶嵌两部分。艺人们先将瓷器剪裁成用于镶嵌的各式小配件，然后按照设计的图案，将配件组合成部位，再把部位组合成整体。组合过程中，还会运用重叠镶嵌、穿插镶嵌等技术，以表现出作品的立体感和层次感。\n潮州嵌瓷不仅具有极高的艺术价值，而且具有深厚的文化内涵。它不仅是潮汕地区传统民居的特色装饰艺术，更是中华民族优秀传统文化的瑰宝之一。如今，潮州嵌瓷已被列入国家级非物质文化遗产名录，得到了更好的传承和发展。\n潮剧传统剧目分宋元南戏和明清传奇、文明戏和新编历史剧两大类，有剧目两千多个。潮剧的表演形式以歌舞、口技和赋诗为主，歌唱和表演动作要求慢而优美，具有较强的音乐性和。节奏感潮剧的角色行当齐全，包括生、旦、净、丑等，每种行当还有不同的类型，表演细腻生动，身段做工既有严谨的程序规范，又富于写意性。其中，生旦戏《扫窗会》被誉为我国戏曲以歌舞演故事的典型代表。\n总之，潮剧作为中华民族优秀文化表现形式的代表之一，具有深刻的历史意义和较高的审美价值，是中国古老戏曲存活于舞台的生动例证。"
    },
]

const getCons = ref([])
onMounted(() => {
    // 根据字体大小改变
    getCons.value.forEach(e => {
        if (e.innerHTML.length >= 400) {
            e.setAttribute('style', '--culture-font-size-p: 16px')
        } else if (e.innerHTML.length >= 600) {
            e.setAttribute('style', '--culture-font-size-p: 14px')
        } else if (e.innerHTML.length >= 800) {
            e.setAttribute('style', '--culture-font-size-p: 12px')
        }
    })
})
</script>

<template>
    <div class="culture">
        <div class="title">
            <img src="@/assets/feiyi.png" alt="" draggable="false" />
        </div>
        <div class="culture-contents">
            <div v-for="cd in cultureData" :data-id="cd.id">
                <div class="imgView">
                    <img :src="cd.oneUrl" alt="" draggable="false" />
                    <img :src="cd.twoUrl" alt="" draggable="false" />
                </div>
                <div class="cons">
                    <h1>{{ cd.title }}</h1>
                    <p ref="getCons">{{ cd.cons }}</p>
                </div>
            </div>
        </div>
    </div>
</template>

<style scoped>
.culture {
    display: flex;
    flex-direction: column;
    align-items: center;
    justify-content: center;
}

.culture .title {
    width: 50%;
}

.culture-contents {
    display: flex;
    flex-wrap: wrap;
    flex-direction: column;
    justify-content: center;
    align-items: center;
    gap: 40px;
}

.culture-contents>div {
    width: 80%;
    display: flex;
    justify-content: center;
    align-items: center;
    flex-direction: row;
    border: 2px dashed #000;
    padding: 20px 60px 20px 80px;
    gap: 40px;
}

.culture-contents>div .imgView {
    width: 30%;
}

.culture-contents>div .imgView img {
    margin: 10px 0;
}

.culture-contents>div .cons {
    width: 70%;
}

.culture-contents>div .cons h1 {
    text-align: center;
    padding: 20px;
}

.culture-contents>div .cons p {
    --culture-font-size-p: 20px;
    font-size: var(--culture-font-size-p);
    line-height: calc(var(--culture-font-size-p) * 1.5);
}
</style>